{"consultant_profiles": [{"name": "Acharya(Civil Engineer)", "text": "Education Details January 2005 S.S.C Baramati, Maharashtra M.E.S. Highschool B.E. Civil Engineering Pune, Maharashtra Singhad Institute Of Technology And Science civil site engineer Civil engineer Skill Details Site Engineer- Exprience - 60 monthsCompany Details company - Vasundhara nirmiti properties description - Civil engineer company - shri balaji housing company description - Execution of all civil work company - Ganesh construction description - Site engineer"}, {"name": "Adhaulia(ETL Developer)", "text": "Computer skills - Yes. SQL knowledge-yes Unix knowledge-yes Data warehouse knowledge-yes Ab intio -yee MY HOBBIES - Playing Cricket, football. Reading books Visiting new places/Travelling. DECLARATION - I hereby declare that the above mentioned information is factual and correct up to the best of my knowledge and belief. Date -.27.01.2019 MR. MANISH PRABHAKAR PATIL Place -MUMBAI Education Details June 2014 to June 2015 Bachelor s Electronics and Telecommunication A C Patil college of Engineering January 2009 to January 2011 Engineering Navi Mumbai, Maharashtra Bharati vidyapeeth January 2008 H.S.C. Mumbai, Maharashtra Khalsa college ETL Informatica Developer ETL DEVELOPER Skill Details ETL- Exprience - Less than 1 year months Data Warehouse- Exprience - Less than 1 year months Datastage- Exprience - Less than 1 year monthsCompany Details company - Reliance Infocomm description - I havevbeen working as ETL Developer in reliance industries in India for the past 3years.I have very good knowledge of Informatica and SQL as well as good knowledge of Unix.I am willing to work in yours company as Developer."}, {"name": "Adhya(Web Designing)", "text": "Technical Skills Web Technologies Angular JS, HTML5, CSS3, SASS, Bootstrap, Jquery, Javascript. Software Brackets, Visual Studio, Photoshop, Visual Studio Code Education Details January 2015 B.E CSE Nagpur, Maharashtra G.H.Raisoni College of Engineering October 2009 Photography Competition Click Nagpur, Maharashtra Maharashtra State Board College Magazine OCEAN Web Designer Web Designer - Trust Systems and Software Skill Details PHOTOSHOP- Exprience - 28 months BOOTSTRAP- Exprience - 6 months HTML5- Exprience - 6 months JAVASCRIPT- Exprience - 6 months CSS3- Exprience - Less than 1 year months Angular 4- Exprience - Less than 1 year monthsCompany Details company - Trust Systems and Software description - Projects worked on 1. TrustBank-CBS Project Description TrustBank-CBS is a core banking solution by Trust Systems. Roles and Responsibility Renovated complete UI to make it more modern, user-friendly, maintainable and optimised for bank use. Shared the UI structure and guidelines to be incorporated, with development team of around 50 members. Achieved the target of project completion in given time frame. Made required graphics for the project in photoshop 2. Loan Bazar Loan Appraisal Project Description Loan Bazar is a MVC-based application dedicated to creating and managing loan applications. The goal of this application is to streamline the process of loan application and integrate with existing CBS. Roles and Responsibility Designed and developed modern and responsive UI of entire application and achieved the target in given time frame. Made required graphics for the project in photoshop 3. Capital Security Bond Application Project Description Capital Security Bond Application is a MVC based application which provided an online platform to purchase gold bond Roles and Responsibility Designed and developed modern and responsive UI of entire application and achieved the target in given time frame. Made required graphics for the project in photoshop 4. SoftGST Project Description SoftGST Web Based Application is an ASP application to every tax payers and its vendors for generating the GSTR returns on the basis of sales / purchase data, additionally the application can do the reconciliation of GSTR 2 A with purchase register. Roles and Responsibility Designed and developed the UI of Dashboard. 5. Trust Analytica Project Description Trust Analytika is the mobile web app that shows bank asset, liability, income, expenses. Roles and Responsibility Designed and developed the landing page of the application. Supported the developers in UI implementation 6. Website s Project Name 1. TSR Technology Services - http //tsrtechnologyservices.com 2. Vidarbha Merchants Urban Co-Op Bank - http //vmcbank.com 3. GISSS - http //gisss.co.in 4. Softtrust USA - http //softtrustusa.com Roles and Responsibility Communicated with clients to understand their requirement Made mocks for the website Designed and developed complete website and hosted them in stipulated time. company - www.jalloshband.com description - Project Name 1. Jallosh Band - www.jalloshband.com 2. An Endeavor Foundation Roles and Responsibility Communicated with clients to understand their requirement Made mocks for the website Designed and developed complete website and hosted them in stipulated time. company - 10MagicalFingers description - National and international client interaction. Management of digital data"}, {"name": "Aenugu(Business Analyst)", "text": "Technical Skills Application Servers IIS 6.0, Jboss 7.1. Database SQL, Oracle and DB2. Report Tool iReport, Crystal report. Career GraphEducation Details Business Analyst Business Analyst - Zensar Technologies Ltd Skill Details CRYSTAL REPORT- Exprience - 15 months DATABASE- Exprience - 6 months DB2- Exprience - 6 months IIS- Exprience - 6 months IIS 6- Exprience - 6 monthsCompany Details company - Zensar Technologies Ltd description - Location Goregoan, Mumbai Client -SUN Pharmaceutical Designation Business Analyst. Role Requirement gathering, gap analysis, support, end user training, documentation. company - Proteus Technologies Pvt Ltd description - Base Information Management Pvt. Ltd. Is a Mumbai base software service provider with core competency and proven track record of installations of Enterprise Wide Solutions. Base customers come from industries as wide as Pharmaceuticals, Life Sciences, Plastics, Engineering, Chemicals company - Wings Infonet Pvt Ltd description - It is IT solutions Provider Company. Company provides comprehensive technology solutions to Accounting, trade, payroll and Asset Management firms across the world. company - Hiral Tektronix Pvt Ltd description - Software relates to recruitment HRMS , accounting, and Payroll. Job Responsibilities ERP Implementation and after go live support. Documenting user requirements and developing specifications for customization. Integrating with other modules, integration testing extending Post Go-live support, including training support to end-users. Drafting functional requirements for ERP systems to represent the processes and functions involved. Guiding the users in using various modules and the management for various functional issues. Delivering awareness about various reports available in ERP system for day to day transactions and for MIS reporting of departments System Audit for better results and follow ups for Observation. Developing and designing report using iReport and crystal report"}, {"name": "Afreen(SAP Developer)", "text": "Education Details January 2016 Bachelor Of Engineering LEAN PROJECTS Mumbai, Maharashtra Mumbai University January 2013 Diploma Computer Engineering Ratnagiri, Maharashtra Maharashtra State Board of Technical Education SAP CONSULTANT SAP CONSULTANT - Quick Learner Skill Details Company Details company - Quick Learner description - Groomed skills with Microsoft Excel. Job Responsibilities Working on Centralized SAP Security project which includes User VBA programming for automation. Level authorizations including Role creation and changes. and Compliance policy maintenance for SAP systems. Confidence and Positive Attitude. Assisting users in troubleshooting and identifying authorization issues using SU53 and trace analysis. Willingness to learn work in team. Working on GRC 10.X Access Control application and all its component. Strong analytical thinking, documentation and design skills Assisting in defining the scope of a project/opportunities, estimating efforts and project timelines. Hands on experience in SAP Market Place for creating User / Adaptable to new environment, with ability to get along with OSS Ids/Developer Keys. people."}, {"name": "Afsar(SAP Developer)", "text": "Education Details May 2013 Master Computer Application Mumbai, Maharashtra IMCOST College April 2010 BSc Computer Science Mumbai, Maharashtra V.K.K. Menon College March 2005 SpringerNature Pune, Maharashtra S.V.V.M School ABAP Developer ABAP Developer - SAP EXPOSURE Skill Details Company Details company - SAP EXPOSURE description - 1. Organization SpringerNature. Duration MAR 2017 -Till date Project Support for springer Nature Project Type Support Role ABAP Developer Major Contribution Writing new reports and modification for existing reports. Worked on smartforms. Standard debugging for issues For unit testing created contracts, orders, and invoices and tested individually. company - Atos Pvt. Ltd description - Duration MAY 2014 -DEC 2015 Project lenM - It s a Ministry of Netherland Project Project DSP - DSM Sinochem Pharmaceuticals Project AkzoNobel - Akzonobel is a leading global paints and coatings company and a major producer of specialty chemicals. Project Type Support Role ABAP Developer Major Contribution Modified SAP Script as per the requirement specified. Modified Invoice Smart Form. Created custom tables, data elements, structures."}, {"name": "Aftab(DevOps Engineer)", "text": "CORE COMPETENCIES Ant Maven GIT Bitbucket Jenkins Linux Ansible Shell Scripting Requirement Gathering Continuous Integration and Continuous Deployment Software Development Life Cycle Software Testing Life Cycle Documentation Reporting Test Reports IT SKILLS Primary Skills Dev-ops methodologies Programming Languages C, Core Java Version Controls GIT, Bitbucket Build Tools ANT, Maven CI/CD Tools Jenkins Configuration management Ansible Scripting Shell Script Application Servers Apache Tomcat serverEducation Details June 2015 to June 2017 Masters of science information technology Hyderabad, Telangana JNTU Devops Engineer Devops Engineer - Nendrasys Technologies Pvt Ltd Skill Details DEPLOYMENT- Exprience - 27 months Git- Exprience - 27 months DOCUMENTATION- Exprience - 26 months CHANGE MANAGEMENT- Exprience - 10 months CONFIGURATION MANAGEMENT- Exprience - 10 monthsCompany Details company - Nendrasys Technologies Pvt Ltd description - Date Project Description The Scope of the project is to design develop e-commerce product features for sloan project. It s a basically B2B project where customer can buy all fixers, sinks related product. It focuses on the company, the stakeholders and applications, which allow for online sales, distribution and marketing of product. Responsibilities o Detailed technical Knowledge and hands-on experience on DevOps, Automation, Build Engineering and Configura - tion Management. o Creating fully automated CI build and deployment infrastructure and processes for multiple projects. o Developing scripts for build, deployment, maintenance and related tasks using Jenkins. o Installing, configuring and maintaining Continuous Integration, Automation and Configuration Management tools. o Developing Ant, Maven and Shell scripts to automatically compile, package, deploy WAR, EAR and JAR files of mul- tiple applications to various platforms. o Creating Repositories, branches, managing the permissions of users and maintaining GIT, Bitbucket o Deploying and maintaining the code and application respectively and configuring the components which increase the re-usability. o Working closely with Architecture, Development, Test, Security and IT Services teams. o Supporting Business Analysts in getting used to the newly created jobs and Release activities. o Communicating daily with On-Site Team o Analyzing the requirements and identifying gaps tracking logs, issues. PROJECT 2 Nendrasys Technologies Pvt Ltd., Project Name Bangkok Bank Limited BBL Thaitrade Commercial, E-commerce Payment portal company - Nendrasys Technologies Pvt Ltd description - Role Devops Engineer Devops Engineer for a team that involved different development teams and multiple simultaneous software re- leases Participated in weekly release meetings with different teams to identify and mitigate potential risks associated with the releases. Responsible for Creating Repositories, branches, managing the permissions of users and maintaining GIT. Creating fully automated CI build and deployment infrastructure and processes for multiple projects. Analyze and resolve conflicts related to merging of source code for GIT Responsible for creating Ant and Maven scripts for build automation. Implemented the setup for Master slave architecture to improve the Performance of Jenkins. Handled end-to-end deployments and code propagation s across different environments, DEV to PROD. Handled the tasks of developing and maintaining the Change Tasks. Closely working with Developers, QA, Performance, UAT testers, IT Team. Created and maintained documentation of build and release processes and application configuration Coordinated with developers, Business Analyst and Mangers to make sure that code is deployed in the Production environment. PROJECT 1 Nendrasys Technologies Pvt Ltd., Project Name Sloan Global Holdings Sloan E-commerce company - Nendrasys Technologies Pvt Ltd description - Project Description BBL is development of an e-commerce payment portal System. As such BBL require a system which can support multiple merchants B2B/B2C e-commerce portal with various payment options via both online and offline. To achieve this BBL had made an agreement with Thai Trade, Thai Trade is one of the leading e-commerce website recognized by Thai government. In present Thai trade has a good base of users and sellers in several categories .The scope of the project is to design and develop e-commerce product features for BBLWTP project. It focuses on the company, the stakeholders and applications, which allow for online sales, distribution and marketing of electronics. Responsibilities o Plan and track activities involved for build and deployment. o Resolving build issues o Developing scripts for build, deployment, maintenance and related tasks using Jenkins. o Collaboration with Development, QA, Product managements on build plans schedules o Send daily and weekly reports to the team. o Involved in creating repositories, branches, merging activities, backup and restore activities in subversion servers. o Maintenance of Maven, shell scripts for safe builds and deploys."}, {"name": "Agarawal(Java Developer)", "text": "Computer Skills Languages And Script JSP, Servlet, HTML, CSS, Java Script, Jquery, Ajax, Spring, Hibernate Operating System Microsoft Windows 2003/XP/Vista/7/8 Databases My SQL Concepts OOPS, Core java, Advance java Development Tool Eclipse, Net beans IDE Web Server Apache Tomcat 7.0Education Details January 2007 H.S.C Amravati, Maharashtra VidyaBharati college January 2005 S.S.C Amravati, Maharashtra Holy Cross English School Java Developer Java Developer - Kunal IT Services Pvt Ltd Skill Details ECLIPSE- Exprience - Less than 1 year months JAVA- Exprience - 14 months HIBERNATE- Exprience - Less than 1 year months SPRING- Exprience - Less than 1 year months jQuery- Exprience - Less than 1 year monthsCompany Details company - Kunal IT Services Pvt Ltd description - Currently Working As Java Developer In Winsol Solution Pvt Ltd From 1 July 2017 To Till Date. Experience Of 2 Yrs As A Java Developer In Kunal IT Services Pvt Ltd."}, {"name": "Agarwal(Java Developer)", "text": "TECHNICALSKILLS SpringMVC, Hibernate, JDBC, Java, J2EE, AzureWeb SunTechnologies Services, JSP, Struts, Servlet, RestApi. Scripting JavaScript, AJAX, HTML, JSON. OpenSourceTechnologies PHP. Database MsSQL, MySQL, Oracle. WebServers ApacheTomcatServer. Internettechnologiesand OnesignalWebPushNotifications, AzurewebServices, frameworks IONIC, HTML, JSON OperatingSystem WindowsServer2012R2, WinXP/7/8.1/10, Linux, Mac OS Education Details August 2013 to July 2016 BE Computer Engineering Nashik, Maharashtra Late G.N. Sapkal COE Nashik July 2009 to June 2013 Diploma Computer technology Nashik, Maharashtra K K Wagh Polytechnic Nashik Java developer Java Developer Skill Details AJAX- Exprience - 12 months DATABASE- Exprience - 24 months HTML- Exprience - 24 months J2EE- Exprience - 6 months JAVA- Exprience - 24 months Spring MVC- Exprience - 12 months Ionic 3- Exprience - 6 months Angular JS- Exprience - 6 months Spring- Exprience - Less than 1 year months Java- Exprience - Less than 1 year monthsCompany Details company - Replete business solutions pvt ltd description - Working as Java developer in spring MVC, MySQL, MsSql, Java, J2EE, Ajax, Javascript, ionic 3 framework, angular js etc. Technologies."}, {"name": "Agate(ETL Developer)", "text": "Computer skills - Yes. SQL knowledge-yes Unix knowledge-yes Data warehouse knowledge-yes Ab intio -yee MY HOBBIES - Playing Cricket, football. Reading books Visiting new places/Travelling. DECLARATION - I hereby declare that the above mentioned information is factual and correct up to the best of my knowledge and belief. Date -.27.01.2019 MR. MANISH PRABHAKAR PATIL Place -MUMBAI Education Details June 2014 to June 2015 Bachelor s Electronics and Telecommunication A C Patil college of Engineering January 2009 to January 2011 Engineering Navi Mumbai, Maharashtra Bharati vidyapeeth January 2008 H.S.C. Mumbai, Maharashtra Khalsa college ETL Informatica Developer ETL DEVELOPER Skill Details ETL- Exprience - Less than 1 year months Data Warehouse- Exprience - Less than 1 year months Datastage- Exprience - Less than 1 year monthsCompany Details company - Reliance Infocomm description - I havevbeen working as ETL Developer in reliance industries in India for the past 3years.I have very good knowledge of Informatica and SQL as well as good knowledge of Unix.I am willing to work in yours company as Developer."}, {"name": "Aggarwal(Java Developer)", "text": "Education Details August 2010 to May 2017 BE Electronics Communication Jabalpur, Madhya Pradesh Takshshila institute of technology Java developer Skill Details Java, Javascript,- Exprience - 6 monthsCompany Details company - Wab It Softwere Pvt. Ltd. description - Jr. Java Developer"}, {"name": "Aggrawal(Automation Testing)", "text": "SKILLS Agile Methodology Scrum, Kanban, Extreme Programming XP , Test-driven development TDD and Feature Driven development FDD Domain Industrial Automation, Retail, Banking, Insurance, Health care. Automation Framework Modular, Data driven, BPT, Hybrid Test automation tool HP UFT, TAF, Load Runner, Selenium, Rational Robot, DCMTK, sikuli languages VB Script, C , Python, Shell Script Bug Tracking Tool Bugzilla, Jira, HP Quality Control, AP Test, Clear Quest Version management Clear case, Win CVS, SVN Database Oracle, SQL server, MySQL Network Protocols TCP/IP, HTTP, HTTPS, VPN, FTP, LDAP Healthcare DICOM, PACS, HL7, Image Archiving, Image reconstruction, Rockwell Automation Logix Designer, Factory Talk, RSLinx Classic, Control Flash, Compare Tool, I/O modules and Profiles. Education Details Bachelor of Science Computer Science Mumbai, Maharashtra Mumbai University QA Automation Lead QA Automation Lead Skill Details C - Exprience - 63 months PYTHON- Exprience - 109 months UFT- Exprience - 85 months SELENIUM- Exprience - 85 months SQL- Exprience - 69 monthsCompany Details company - Leading Industrial Automation description - Responsibilities Test Rockwell Automation embedded systems such as Logix Designer, Factory Talk, RSLinx Classic, Control Flash, Compare Tool, I/O modules and Profiles. Coordinate with Onsite and Offshore QA leads to design and develop test strategy and test plan. Document test plan and test cases base on product Requirement Document and functional specification. Discussed and explained the requirement to QA team. Work in Scrum base Agile Methodology and Test Driven development environment with frequent changing requirements and lots of challenges. Document and Published Program Increment Objectives, Program Increment planning report, Feature Epics, Backlog and Stories. Conduct and Participated in Program Increment Planning, Backlog Grooming, Sprint Planning, Daily Stand Ups, Sprint Review and Retrospective. Perform Automation testing tasks such as Design, Create, Maintain, Execute and peer review test scripts using Test Automation Framework TAF Develop and Execute System integration and GUI integration test using C . Interact with Business Analysts and Software Developers for bug review and participated in QA meetings. Work closely with development and engineering department to ensure proper resolution of bugs. Proactively came up with innovative methods to improve software quality, test coverage, efficiency and regression coverage. Created and Maintained testing documents such as High Level Requirement, Test strategy report, Test plan, Test cases, Test execution results, Bug report, Quality Metrics, Traceability Matrix and Testing Summary Reports. Environment Logix Designer, Factory Talk, RSLinx Classic, ControlFlash, CompareTool, I/O modules, Profiles, Test Automation Framework TAF , C , Python, Selenium, Clear Case, Clear Quest, UFT, Collaborative Lifecycle Management, and Version-one. company - GE-Healthcare description - Responsibilities Validated GE CT scanners based on FDA compliances and regulations. Interacted with Clinical experts, Business Analysts and Development architect for creation of test strategy and test plan. Coordinated with the Offshore QA and Onsite QA team to work on design and develop of test strategies and requirement traceability matrix. Designed, Created and executed manual test cases base on product requirement documents. Increased productivity by initiating use of automation tools like DICOM and QTP. Trained and guided GE team on automation test creation and execution using QTP. Performed testing types such as functional, integration, performance and regression and Provide test reports to management. Involved in release support, test bed creation testing throughout release process. Environment Agile, Test-driven development TDD , DICOM, HL7, Image reconstruction, Windows, Linux, SQL, C, Python, QTP, HTML, XML, QTP, VBScripts and QC company - Patni-GE-Healthcare PACS description - Responsibilities Validated GE PACS application and tested web application defined for Administration, Authentication and Archiving of DICOM images. Involved in the creation of Automation framework by using Hybrid and BPT approach. Responsible for creation of Test Bed and Golden Data using DCMTK. Prepared the Test Scenarios, Test plan, Test cases and Automation Scripts for Integration, System and End-to-End testing on all applications. Designed and developed User defined and Generic functions with well-versed VB scripting. Descriptive programming in scripting dynamic objects and reusable actions in defining scenario flows in UFT/QTP. Reviewed the QTP Scripts developed by the team members. Supported the QA/SIT and Regression testing team for environmental issues and Interact with other downstream environment system team for the clarifications. Environment Agile, Test-driven development TDD , GE PACS, DICOM, HL7, Image reconstruction, Image Construction, Windows, Linux, SQL, C, Python, Selenium, QTP, HTML, XML, QTP, JavaScript, VBScripts and QC company - HDFC Bank Limited description - Responsibilities Reviewed Business requirements, design documents and prepared test cases for assigned project releases. Performed testing types such as API, functional, integration, System, performance, regression, security and network. Provide test reports to management. Involved in integration testing for release of new functionality. Testing critical bug s fixes and co-ordinate with developer in fixing these critical bugs. Involved in backend database testing in oracle and Microsoft SQL. Involved in release support, test bed setup testing throughout release process. Automation of test flow s using automated tools QTP 10. Environment Windows, Linux, SQL, C, Python, QTP, HTML, XML, QTP, JavaScript, VBScripts and QC company - Vistaar Systems Limited description - Responsibilities Referred Business requirements documents, Use case documents and Design documents provided by client and developer for creation of Manual and Automation test cases. Involved in Analysis, Design, Creation, Execution and Debugging of automation scripts using automation tools like Rational Robot, QTP and Shell scripting. Testing critical bug s fixes and co-ordinate with developer in fixing these critical bugs. Involved in Installation of build, Maintaining test bed, Smoke and Sanitary testing, Regression testing, Performance testing and Database testing using Rational Robot, QTP and Shell scripting. Environment Windows, Linux, SQL, Rational Robot V2002 and QTP V 9.2."}, {"name": "Agrahari(Hadoop)", "text": "Education Details Hadoop Developer Hadoop Developer - INFOSYS Skill Details Company Details company - INFOSYS description - Project Description The banking information had stored the data in different data ware house systems for each department but it becomes difficult for the organization to manage the data and to perform some analytics on the past data, so it is combined them into a single global repository in Hadoop for analysis. Responsibilities Analyze the banking rates data set. Create specification document. Provide effort estimation. Develop SPARK Scala, SPARK SQL Programs using Eclipse IDE on Windows/Linux environment. Create KPI s test scenarios, test cases, test result document. Test the Scala programs in Linux Spark Standalone mode. setup multi cluster on AWS, deploy the Spark Scala programs Provided solution using Hadoop ecosystem - HDFS, MapReduce, Pig, Hive, HBase, and Zookeeper. Provided solution using large scale server-side systems with distributed processing algorithms. Created reports for the BI team using Sqoop to export data into HDFS and Hive. Provided solution in supporting and assisting in troubleshooting and optimization of MapReduce jobs and Pig Latin scripts. Deep understanding of Hadoop design principles, cluster connectivity, security and the factors that affect system performance. Worked on Importing and exporting data from different databases like Oracle, Teradata into HDFS and Hive using Sqoop, TPT and Connect Direct. Import and export the data from RDBMS to HDFS/HBASE Wrote script and placed it in client side so that the data moved to HDFS will be stored in temporary file and then it will start loading it in hive tables. Developed the Sqoop scripts in order to make the interaction between Pig and MySQL Database. Involved in developing the Hive Reports, Partitions of Hive tables. Created and maintained technical documentation for launching HADOOP Clusters and for executing HIVE queries and PIG scripts. Involved in running Hadoop jobs for processing millions of records of text data Environment Java, Hadoop, HDFS, Map-Reduce, Pig, Hive, Sqoop, Flume, Oozie, HBase, Spark, Scala, Linux, NoSQL, Storm, Tomcat, Putty, SVN, GitHub, IBM WebSphere v8.5. Project 1 TELECOMMUNICATIONS Hadoop Developer Description To identify customers who are likely to churn and 360-degree view of the customer is created from different heterogeneous data sources. The data is brought into data lake HDFS from different sources and analyzed using different Hadoop tools like pig and hive. Responsibilities Installed and Configured Apache Hadoop tools like Hive, Pig, HBase and Sqoop for application development and unit testing. Wrote MapReduce jobs to discover trends in data usage by users. Involved in database connection using SQOOP. Involved in creating Hive tables, loading data and writing hive queries Using the HiveQL. Involved in partitioning and joining Hive tables for Hive query optimization. Experienced in SQL DB Migration to HDFS. Used NoSQL HBase for faster performance, which maintains the data in the De-Normalized way for OLTP. The data is collected from distributed sources into Avro models. Applied transformations and standardizations and loaded into HBase for further data processing. Experienced in defining job flows. Used Oozie to orchestrate the workflow. Implemented Fair schedulers on the Job tracker to share the resources of the Cluster for the Map Reduce jobs given by the users. Exported the analyzed data to the relational databases using HIVE for visualization and to generate reports for the BI team. Environment Hadoop, Hive, Linux, MapReduce, HDFS, Hive, Python, Pig, Sqoop, Cloudera, Shell Scripting, Java JDK 1.6 , Java 6, Oracle 10g, PL/SQL, SQL PLUS"}, {"name": "Agrawal(DevOps Engineer)", "text": "CORE COMPETENCIES Ant Maven GIT Bitbucket Jenkins Linux Ansible Shell Scripting Requirement Gathering Continuous Integration and Continuous Deployment Software Development Life Cycle Software Testing Life Cycle Documentation Reporting Test Reports IT SKILLS Primary Skills Dev-ops methodologies Programming Languages C, Core Java Version Controls GIT, Bitbucket Build Tools ANT, Maven CI/CD Tools Jenkins Configuration management Ansible Scripting Shell Script Application Servers Apache Tomcat serverEducation Details June 2015 to June 2017 Masters of science information technology Hyderabad, Telangana JNTU Devops Engineer Devops Engineer - Nendrasys Technologies Pvt Ltd Skill Details DEPLOYMENT- Exprience - 27 months Git- Exprience - 27 months DOCUMENTATION- Exprience - 26 months CHANGE MANAGEMENT- Exprience - 10 months CONFIGURATION MANAGEMENT- Exprience - 10 monthsCompany Details company - Nendrasys Technologies Pvt Ltd description - Date Project Description The Scope of the project is to design develop e-commerce product features for sloan project. It s a basically B2B project where customer can buy all fixers, sinks related product. It focuses on the company, the stakeholders and applications, which allow for online sales, distribution and marketing of product. Responsibilities o Detailed technical Knowledge and hands-on experience on DevOps, Automation, Build Engineering and Configura - tion Management. o Creating fully automated CI build and deployment infrastructure and processes for multiple projects. o Developing scripts for build, deployment, maintenance and related tasks using Jenkins. o Installing, configuring and maintaining Continuous Integration, Automation and Configuration Management tools. o Developing Ant, Maven and Shell scripts to automatically compile, package, deploy WAR, EAR and JAR files of mul- tiple applications to various platforms. o Creating Repositories, branches, managing the permissions of users and maintaining GIT, Bitbucket o Deploying and maintaining the code and application respectively and configuring the components which increase the re-usability. o Working closely with Architecture, Development, Test, Security and IT Services teams. o Supporting Business Analysts in getting used to the newly created jobs and Release activities. o Communicating daily with On-Site Team o Analyzing the requirements and identifying gaps tracking logs, issues. PROJECT 2 Nendrasys Technologies Pvt Ltd., Project Name Bangkok Bank Limited BBL Thaitrade Commercial, E-commerce Payment portal company - Nendrasys Technologies Pvt Ltd description - Role Devops Engineer Devops Engineer for a team that involved different development teams and multiple simultaneous software re- leases Participated in weekly release meetings with different teams to identify and mitigate potential risks associated with the releases. Responsible for Creating Repositories, branches, managing the permissions of users and maintaining GIT. Creating fully automated CI build and deployment infrastructure and processes for multiple projects. Analyze and resolve conflicts related to merging of source code for GIT Responsible for creating Ant and Maven scripts for build automation. Implemented the setup for Master slave architecture to improve the Performance of Jenkins. Handled end-to-end deployments and code propagation s across different environments, DEV to PROD. Handled the tasks of developing and maintaining the Change Tasks. Closely working with Developers, QA, Performance, UAT testers, IT Team. Created and maintained documentation of build and release processes and application configuration Coordinated with developers, Business Analyst and Mangers to make sure that code is deployed in the Production environment. PROJECT 1 Nendrasys Technologies Pvt Ltd., Project Name Sloan Global Holdings Sloan E-commerce company - Nendrasys Technologies Pvt Ltd description - Project Description BBL is development of an e-commerce payment portal System. As such BBL require a system which can support multiple merchants B2B/B2C e-commerce portal with various payment options via both online and offline. To achieve this BBL had made an agreement with Thai Trade, Thai Trade is one of the leading e-commerce website recognized by Thai government. In present Thai trade has a good base of users and sellers in several categories .The scope of the project is to design and develop e-commerce product features for BBLWTP project. It focuses on the company, the stakeholders and applications, which allow for online sales, distribution and marketing of electronics. Responsibilities o Plan and track activities involved for build and deployment. o Resolving build issues o Developing scripts for build, deployment, maintenance and related tasks using Jenkins. o Collaboration with Development, QA, Product managements on build plans schedules o Send daily and weekly reports to the team. o Involved in creating repositories, branches, merging activities, backup and restore activities in subversion servers. o Maintenance of Maven, shell scripts for safe builds and deploys."}, {"name": "Ahamad(Database)", "text": "TECHNICAL EXPERTISE DB Languages SQL Database Tools SQL Server 2014/ 2017 Postgresql 9.5, 9.6, Oracle 11gR2 Operating Systems Redhat Linux, Oracle Linux, Windows Server 2012/ 2016 OTHER TECHNICAL SKILLS ORACLE 11G R2 Proficient in Oracle Database Software Installation, Creation of Database using GUI/Silent DBCA, Architecture, File management, Space Management, User Management, Creating Roles and assigning Privileges/Roles in 11gR2 and troubleshooting them. Hands on experience Control files/Redolog/Archive/Undo Management Configuring Listener.ora/Tnsnames.ora file using Netmgr/netca Generating AWR reports, ADDM, ASH reports to diagnose the problems Database Backup, Cloning/Duplicate using hot cold backups using RMAN. Knowledge in Flashback Technologies Expdp/Impdp Implemented Oracle11gR2 RAC on Oracle Linux Platform and knowledge of services for troubleshooting RAC CRSCTL, SRVCTL Knowledge on installation and configuration of RAC. Add/Remove Nodes on RAC Configuration of physical standby database Data guard Successfully upgraded from 11.2.0.1 to 11.2.0.4 PSU patching using O patch. STRENGTHS Good Communication skills. Self-confident and can adapt myself to all work environments. Enjoy responsibilities as lead and team player. Patient listener quick learner. Capable of explaining issues solving them.Education Details B.E Computer Engineering Mumbai, Maharashtra Mumbai University Higher Secondary Certificate Dr. DY Patil Jr College Database Administrator Database Administrator - DBA in Marketplace Technologies Ltd Skill Details DATABASE- Exprience - 61 months BACKUPS- Exprience - 48 months LINUX- Exprience - 48 months MS SQL SERVER- Exprience - 48 months SQL- Exprience - 48 monthsCompany Details company - DBA in Marketplace Technologies Ltd description - Project Title EBoss, Datafeed, MFDB, RTRMS, IndiaINX company - Standard Enterprise description - Redhat Linux 7.4, Postgresql 9.5, 9.6 Duration Feb 2017 - till date Description Bombay Stock Exchange BSE is Asia s first the Fastest Stock Exchange in world with the speed of 6 micro seconds and one of India s leading exchange groups provides an efficient and transparent market for trading in equity, currencies, debt instruments, derivatives, mutual funds. BSE SME is India s largest SME platform which has listed over 250 companies and continues to grow at a steady pace. JOB ROLES RESPONSIBILITIES POSTGRESQL - Worked on Redhat Linux OS Cluster with Postgresql for High Availability HA using Pacemaker. Coordinated with Developers/Linux teams for database knowledge and support. Participated in implementation of new releases into production. Installed /Configured Postgresql from source or packages on Redhat Linux servers. Performed Postgresql Server Management tasks i.e. Backup Restore, Configuration, Roles, Blockings, Tablespace creation and Troubleshooting. Worked with Storage team for Disaster Recovery DR setup built on SAN using EMC technology Configured LDAP authentication GSSAPI Authentication from Windows to Linux for Postgresql. Configured logical replication for Database servers, hot standby Postgresql servers, faster database backup methods, schema and tablespace backups. Configured maximum connections to database on Linux servers. Installed tds fdw from source for linked servers to connect to heterogeneous databases other required extensions, backup configuration, PITR using base backups. MSSQL - Day-to-day administration of live SQL Servers. Participated in Live Primary Recovery PR Disaster Recovery DR activities. Participated in PR DR mocks for new releases into production. Configured Linked Servers, Transactional replication, Maintenance tasks like database backup restore, recovery, scheduled jobs, maintenance plans. Installed Configured SQL server 2014, 2017 standalone and SQL Cluster servers. Maintained the security of the database by providing appropriate SQL roles, logins and permissions to the users on demand. Worked with teams on application rollouts, application issues and SQL server migrations. Exposure in handling production system with skills and understand client s requirement. Performed SQL Server service pack upgrades and hot fixes. Handled multiple SQL Instances on Windows SQL Cluster environment built on EMC SAN. Worked on MSSQL DB clusters with active/active active passive servers, Always-On Availability Groups AAG and HA/DR Setup. Have experience on SAN and RAID levels and building and supporting SQL Cluster servers on SAN Environments. company - BSE Bombay Stock Exchange description - Environment Windows server 2008 R2, 2012 R2, 2016 Enterprise Standard,"}]}